IDEA StatiCa Open Model
CrossSectionFactory.FillColdFormedZ Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill parameters for cold formed Z section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillColdFormedZ(
	CrossSectionParameter css,
	double Width,
	double Height,
	double Thickness,
	double Radius,
	bool Mirror
)
Public Shared Sub FillColdFormedZ (
	css As CrossSectionParameter,
	Width As Double,
	Height As Double,
	Thickness As Double,
	Radius As Double,
	Mirror As Boolean
)
public:
static void FillColdFormedZ(
	CrossSectionParameter^ css,
	double Width,
	double Height,
	double Thickness,
	double Radius,
	bool Mirror
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width
Type: System.Double
Css width
Height
Type: System.Double
Height of cross-section
Thickness
Type: System.Double
Thickness
Radius
Type: System.Double
Inside radius
Mirror
Type: System.Boolean
Mirrored shape
Remarks
Dimension of cold formed Z section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 6;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.003;
double Radius = 0.005;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZ(css, Width, Height, Thickness, Radius, Mirror);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace